In [1]:
import pandas as pd

In [ ]:
# pandas merge
df1 = pd.DataFrame({'Player_ID': [1, 2], 'Name': ['Shane Warne', 'Victor Trumper']})

df2 = pd.DataFrame({'Player_ID': [1, 2], 'Salary': [50000, 100000]})

In [3]:
df1.head()

   Player_ID            Name
0          1     Shane Warne
1          2  Victor Trumper

In [4]:
df2.head()

   Player_ID  Salary
0          1   50000
1          2  100000

In [5]:
merged_df = pd.merge(df1, df2, on='Player_ID')
merged_df.head()

   Player_ID            Name  Salary
0          1     Shane Warne   50000
1          2  Victor Trumper  100000

In [6]:
# Merge with Different Column Names
df3 = pd.DataFrame({'Player_ID': [1, 2], 'Name': ['Shane Warne', 'Victor Trumper']})

df4 = pd.DataFrame({'Cricketer_id': [1, 2], 'Salary': [50000, 100000]})

merged_df_2 = pd.merge(df3, df4, left_on='Player_ID', right_on='Cricketer_id')

merged_df_2 = merged_df_2.drop('Cricketer_id', axis=1)
merged_df_2.head(10)

   Player_ID            Name  Salary
0          1     Shane Warne   50000
1          2  Victor Trumper  100000

In [7]:
df5 = pd.DataFrame({'Player_ID': [1, 2, 3], 'Name': ['Shane Warne', 'Victor Trumper', 'Don Bradman']})

df6 = pd.DataFrame({'Cricketer_id': [1, 2, 4], 'Salary': [50000, 100000, 200000]})

merged_df_left = pd.merge(df5, df6, left_on='Player_ID', right_on='Cricketer_id', how='left')
merged_df_left.head()

   Player_ID            Name  Cricketer_id    Salary
0          1     Shane Warne           1.0   50000.0
1          2  Victor Trumper           2.0  100000.0
2          3     Don Bradman           NaN       NaN

In [8]:
merged_df_inner = pd.merge(df5, df6, left_on='Player_ID', right_on='Cricketer_id', how='inner')
merged_df_inner.head(10)

   Player_ID            Name  Cricketer_id  Salary
0          1     Shane Warne             1   50000
1          2  Victor Trumper             2  100000

In [9]:
merged_df_outer = pd.merge(df5, df6, left_on='Player_ID', right_on='Cricketer_id', how='outer')
merged_df_outer.head(10)

   Player_ID            Name  Cricketer_id    Salary
0        1.0     Shane Warne           1.0   50000.0
1        2.0  Victor Trumper           2.0  100000.0
2        3.0     Don Bradman           NaN       NaN
3        NaN             NaN           4.0  200000.0

In [11]:
# suffixes
df_national = pd.DataFrame({
    'Player_ID': [1, 2, 3],
    'Name': ['Shane Warne', 'Victor Trumper', 'Don Bradman'],
    'Team': ['Australia', 'Australia', 'Australia']
})

df_professional = pd.DataFrame({
    'Player_ID': [1, 2, 4],
    'Name': ['Shane Warne', 'Victor Trumper', 'Virat Kohli'],
    'Team': ['Rajasthan Royals', 'Sydney CC', 'RCB']  # Professional teams
})

cricket_suffixes_df = pd.merge(df_national, df_professional, on='Player_ID', suffixes=('_National', '_Professional'), how='left')
cricket_suffixes_df.head()

   Player_ID   Name_National Team_National Name_Professional Team_Professional
0          1     Shane Warne     Australia       Shane Warne  Rajasthan Royals
1          2  Victor Trumper     Australia    Victor Trumper         Sydney CC
2          3     Don Bradman     Australia               NaN               NaN

In [13]:
df_teams = pd.DataFrame({
    'Team_ID': [1, 2, 3],
    'Team_Name': ['India', 'Australia', 'Pakistan']
})


df_outcomes = pd.DataFrame({
    'Outcome': ['Win', 'Loss']
})

df_match_outcomes = pd.merge(df_teams, df_outcomes, how='cross')
df_match_outcomes.head(10)

   Team_ID  Team_Name Outcome
0        1      India     Win
1        1      India    Loss
2        2  Australia     Win
3        2  Australia    Loss
4        3   Pakistan     Win
5        3   Pakistan    Loss